{
    "index2word": [
        "<pad>",
        "<sos>",
        "<eos>",
        "s_0s",
        "s_1s",
        "s_2s",
        "s_3s",
        "s_4s",
        "s_5s",
        "s_6s",
        "s_7s",
        "a_0s",
        "a_1s",
        "a_2s",
        "a_3s",
        "a_4s",
        "a_5s",
        "e_0s",
        "e_1s",
        "e_2s",
        "e_3s",
        "e_4s",
        "e_5s",
        "e_6s",
        "hb0_0s",
        "hb0_1s",
        "hb0_2s",
        "hb0_3s",
        "hb0_4s",
        "hb0_5s",
        "hb0_6s",
        "hb0_7s",
        "hb0_8s",
        "hb0_9s",
        "hb0_10s",
        "hb0_11s",
        "hb0_12s",
        "hb0_13s",
        "hb0_14s",
        "hb0_15s",
        "hb0_16s",
        "hb0_17s",
        "hb0_18s",
        "hb0_19s",
        "hb0_20s",
        "hb0_21s",
        "hb0_22s",
        "hb0_23s",
        "hb0_24s",
        "hb0_25s",
        "hb0_26s",
        "hb0_27s",
        "hb0_28s",
        "hb0_29s",
        "hb0_30s",
        "hb0_31s",
        "hb0_32s",
        "hb0_33s",
        "hb0_34s",
        "hb1_0s",
        "hb1_1s",
        "hb1_2s",
        "hb1_3s",
        "hb1_4s",
        "hb1_5s",
        "hb1_6s",
        "hb1_7s",
        "hb1_8s",
        "hb1_9s",
        "hb1_10s",
        "hb1_11s",
        "hb1_12s",
        "hb1_13s",
        "hb1_14s",
        "hb1_15s",
        "hb1_16s",
        "hb1_17s",
        "hb1_18s",
        "hb1_19s",
        "hb1_20s",
        "hb1_21s",
        "hb1_22s",
        "hb1_23s",
        "hb1_24s",
        "hb1_25s",
        "hb1_26s",
        "hb1_27s",
        "hb1_28s",
        "hb1_29s",
        "hb1_30s",
        "hb1_31s",
        "hb1_32s",
        "hb1_33s",
        "hb1_34s",
        "p_0s",
        "p_1s",
        "p_2s",
        "p_3s",
        "p_4s",
        "p_5s",
        "p_6s",
        "p_7s",
        "p_8s",
        "p_9s",
        "c_0s",
        "c_1s",
        "c_2s",
        "c_3s",
        "c_4s",
        "c_5s",
        "c_6s",
        "c_7s",
        "c_8s",
        "c_9s",
        "t_0s",
        "t_1s",
        "t_2s",
        "t_3s",
        "t_4s",
        "t_5s",
        "t_6s",
        "t_7s",
        "t_8s",
        "t_9s",
        "t_10s",
        "t_11s",
        "t_12s",
        "t_13s",
        "t_14s"
    ],
    "word2count": {
        "<eos>": 1,
        "<pad>": 1,
        "<sos>": 1,
        "a_0s": 1111,
        "a_1s": 1466,
        "a_2s": 1748,
        "a_3s": 721,
        "a_4s": 921,
        "a_5s": 842,
        "c_0s": 1155,
        "c_1s": 347,
        "c_2s": 314,
        "c_3s": 530,
        "c_4s": 317,
        "c_5s": 698,
        "c_6s": 414,
        "c_7s": 497,
        "c_8s": 727,
        "c_9s": 799,
        "e_0s": 653,
        "e_1s": 565,
        "e_2s": 801,
        "e_3s": 334,
        "e_4s": 300,
        "e_5s": 814,
        "e_6s": 701,
        "hb0_0s": 214,
        "hb0_10s": 185,
        "hb0_11s": 236,
        "hb0_12s": 255,
        "hb0_13s": 132,
        "hb0_14s": 206,
        "hb0_15s": 186,
        "hb0_16s": 330,
        "hb0_17s": 296,
        "hb0_18s": 226,
        "hb0_19s": 313,
        "hb0_1s": 308,
        "hb0_20s": 241,
        "hb0_21s": 270,
        "hb0_22s": 326,
        "hb0_23s": 220,
        "hb0_24s": 254,
        "hb0_25s": 163,
        "hb0_26s": 370,
        "hb0_27s": 281,
        "hb0_28s": 205,
        "hb0_29s": 323,
        "hb0_2s": 386,
        "hb0_30s": 168,
        "hb0_31s": 349,
        "hb0_32s": 387,
        "hb0_33s": 169,
        "hb0_34s": 185,
        "hb0_3s": 206,
        "hb0_4s": 312,
        "hb0_5s": 166,
        "hb0_6s": 390,
        "hb0_7s": 350,
        "hb0_8s": 161,
        "hb0_9s": 371,
        "hb1_0s": 199,
        "hb1_10s": 243,
        "hb1_11s": 190,
        "hb1_12s": 164,
        "hb1_13s": 119,
        "hb1_14s": 202,
        "hb1_15s": 124,
        "hb1_16s": 288,
        "hb1_17s": 288,
        "hb1_18s": 208,
        "hb1_19s": 305,
        "hb1_1s": 319,
        "hb1_20s": 120,
        "hb1_21s": 252,
        "hb1_22s": 254,
        "hb1_23s": 185,
        "hb1_24s": 266,
        "hb1_25s": 248,
        "hb1_26s": 360,
        "hb1_27s": 448,
        "hb1_28s": 289,
        "hb1_29s": 349,
        "hb1_2s": 373,
        "hb1_30s": 222,
        "hb1_31s": 371,
        "hb1_32s": 352,
        "hb1_33s": 183,
        "hb1_34s": 214,
        "hb1_3s": 192,
        "hb1_4s": 362,
        "hb1_5s": 173,
        "hb1_6s": 346,
        "hb1_7s": 380,
        "hb1_8s": 184,
        "hb1_9s": 285,
        "p_0s": 623,
        "p_1s": 999,
        "p_2s": 1081,
        "p_3s": 791,
        "p_4s": 912,
        "p_5s": 656,
        "p_6s": 1534,
        "p_7s": 1399,
        "p_8s": 2506,
        "p_9s": 1594,
        "s_0s": 727,
        "s_1s": 959,
        "s_2s": 3003,
        "s_3s": 3808,
        "s_4s": 677,
        "s_5s": 961,
        "s_6s": 423,
        "s_7s": 1012,
        "t_0s": 663,
        "t_10s": 370,
        "t_11s": 284,
        "t_12s": 251,
        "t_13s": 408,
        "t_14s": 749,
        "t_1s": 393,
        "t_2s": 678,
        "t_3s": 391,
        "t_4s": 1155,
        "t_5s": 422,
        "t_6s": 675,
        "t_7s": 567,
        "t_8s": 441,
        "t_9s": 578
    },
    "word2index": {
        "<eos>": 2,
        "<pad>": 0,
        "<sos>": 1,
        "a_0s": 11,
        "a_1s": 12,
        "a_2s": 13,
        "a_3s": 14,
        "a_4s": 15,
        "a_5s": 16,
        "c_0s": 104,
        "c_1s": 105,
        "c_2s": 106,
        "c_3s": 107,
        "c_4s": 108,
        "c_5s": 109,
        "c_6s": 110,
        "c_7s": 111,
        "c_8s": 112,
        "c_9s": 113,
        "e_0s": 17,
        "e_1s": 18,
        "e_2s": 19,
        "e_3s": 20,
        "e_4s": 21,
        "e_5s": 22,
        "e_6s": 23,
        "hb0_0s": 24,
        "hb0_10s": 34,
        "hb0_11s": 35,
        "hb0_12s": 36,
        "hb0_13s": 37,
        "hb0_14s": 38,
        "hb0_15s": 39,
        "hb0_16s": 40,
        "hb0_17s": 41,
        "hb0_18s": 42,
        "hb0_19s": 43,
        "hb0_1s": 25,
        "hb0_20s": 44,
        "hb0_21s": 45,
        "hb0_22s": 46,
        "hb0_23s": 47,
        "hb0_24s": 48,
        "hb0_25s": 49,
        "hb0_26s": 50,
        "hb0_27s": 51,
        "hb0_28s": 52,
        "hb0_29s": 53,
        "hb0_2s": 26,
        "hb0_30s": 54,
        "hb0_31s": 55,
        "hb0_32s": 56,
        "hb0_33s": 57,
        "hb0_34s": 58,
        "hb0_3s": 27,
        "hb0_4s": 28,
        "hb0_5s": 29,
        "hb0_6s": 30,
        "hb0_7s": 31,
        "hb0_8s": 32,
        "hb0_9s": 33,
        "hb1_0s": 59,
        "hb1_10s": 69,
        "hb1_11s": 70,
        "hb1_12s": 71,
        "hb1_13s": 72,
        "hb1_14s": 73,
        "hb1_15s": 74,
        "hb1_16s": 75,
        "hb1_17s": 76,
        "hb1_18s": 77,
        "hb1_19s": 78,
        "hb1_1s": 60,
        "hb1_20s": 79,
        "hb1_21s": 80,
        "hb1_22s": 81,
        "hb1_23s": 82,
        "hb1_24s": 83,
        "hb1_25s": 84,
        "hb1_26s": 85,
        "hb1_27s": 86,
        "hb1_28s": 87,
        "hb1_29s": 88,
        "hb1_2s": 61,
        "hb1_30s": 89,
        "hb1_31s": 90,
        "hb1_32s": 91,
        "hb1_33s": 92,
        "hb1_34s": 93,
        "hb1_3s": 62,
        "hb1_4s": 63,
        "hb1_5s": 64,
        "hb1_6s": 65,
        "hb1_7s": 66,
        "hb1_8s": 67,
        "hb1_9s": 68,
        "p_0s": 94,
        "p_1s": 95,
        "p_2s": 96,
        "p_3s": 97,
        "p_4s": 98,
        "p_5s": 99,
        "p_6s": 100,
        "p_7s": 101,
        "p_8s": 102,
        "p_9s": 103,
        "s_0s": 3,
        "s_1s": 4,
        "s_2s": 5,
        "s_3s": 6,
        "s_4s": 7,
        "s_5s": 8,
        "s_6s": 9,
        "s_7s": 10,
        "t_0s": 114,
        "t_10s": 124,
        "t_11s": 125,
        "t_12s": 126,
        "t_13s": 127,
        "t_14s": 128,
        "t_1s": 115,
        "t_2s": 116,
        "t_3s": 117,
        "t_4s": 118,
        "t_5s": 119,
        "t_6s": 120,
        "t_7s": 121,
        "t_8s": 122,
        "t_9s": 123
    }
}